In [1]:
#Import required libraries
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
#Reading a csv file
df = pd.read_csv('No2.csv')

In [3]:
#Dimension of the dataframe
df.shape

(4737, 2)

In [4]:
#First 5 rows of the dataframe
df.head()

             Date_Time  NO2(GT)
0  10/03/2004 18.00.00      166
1  10/03/2004 19.00.00     1174
2  10/03/2004 20.00.00      131
3  10/03/2004 21.00.00      172
4  10/03/2004 22.00.00      131

In [5]:
df['Date_Time'].min(), df['Date_Time'].max()

('01/04/2004 00.00.00', '31/08/2004 23.00.00')

In [6]:
#Data type
df.dtypes

Date_Time    object
NO2(GT)       int64
dtype: object

### Convert to DateTime

In [7]:
df['Date_Time'] = pd.to_datetime(df['Date_Time'], format='%d/%m/%Y %H.%M.%S')
df.dtypes

Date_Time    datetime64[ns]
NO2(GT)               int64
dtype: object

The format depends on your data. Here are a few examples

1. **1/12/2001 :** %d/%m/%Y
2. **2001/12/1 :** %Y/%m/%d
3. **2001-12-01 :** %Y-%m-%d
4. **2001-12-01 09:00 :** %Y-%m-%d %H:%M

In [8]:
df['Date_Time'].min(), df['Date_Time'].max()

(Timestamp('2004-03-10 18:00:00'), Timestamp('2004-09-24 02:00:00'))

### Extract Hour and Minute

In [9]:
#Extract Hours
df['Date_Time'].dt.hour.head()

0    18
1    19
2    20
3    21
4    22
Name: Date_Time, dtype: int64

In [10]:
#Extract Hours
df['Date_Time'].dt.strftime('%H')

0       18
1       19
2       20
3       21
4       22
        ..
4732    22
4733    23
4734    00
4735    01
4736    02
Name: Date_Time, Length: 4737, dtype: object

In [11]:
#Extract Minutes
df['Date_Time'].dt.minute.head()

0    0
1    0
2    0
3    0
4    0
Name: Date_Time, dtype: int64

In [12]:
#Extract Minutes
df['Date_Time'].dt.strftime('%M')

0       00
1       00
2       00
3       00
4       00
        ..
4732    00
4733    00
4734    00
4735    00
4736    00
Name: Date_Time, Length: 4737, dtype: object

### The day of week - Monday (0) to Sunday (6)

In [13]:
#Extract day of the week
df['Date_Time'].dt.dayofweek.head(7)

0    2
1    2
2    2
3    2
4    2
5    2
6    3
Name: Date_Time, dtype: int64

In [14]:
#Extract day of the week
df['Date_Time'].dt.weekday.head(7)

0    2
1    2
2    2
3    2
4    2
5    2
6    3
Name: Date_Time, dtype: int64

In [15]:
#Extract day name
df['Date_Time'].dt.strftime("%A")

0       Wednesday
1       Wednesday
2       Wednesday
3       Wednesday
4       Wednesday
          ...
4732     Thursday
4733     Thursday
4734       Friday
4735       Friday
4736       Friday
Name: Date_Time, Length: 4737, dtype: object

In [16]:
#Extract day name
df['Date_Time'].dt.strftime("%a")

0       Wed
1       Wed
2       Wed
3       Wed
4       Wed
       ...
4732    Thu
4733    Thu
4734    Fri
4735    Fri
4736    Fri
Name: Date_Time, Length: 4737, dtype: object

### Extracting the month from the date

In [17]:
#Extract months
df['Date_Time'].dt.month.head()

0    3
1    3
2    3
3    3
4    3
Name: Date_Time, dtype: int64

In [18]:
#Extract months
df['Date_Time'].dt.strftime('%m')

0       03
1       03
2       03
3       03
4       03
        ..
4732    09
4733    09
4734    09
4735    09
4736    09
Name: Date_Time, Length: 4737, dtype: object

In [19]:
#Check whether it is end of month or not
df['Date_Time'].dt.is_month_end

0       False
1       False
2       False
3       False
4       False
        ...
4732    False
4733    False
4734    False
4735    False
4736    False
Name: Date_Time, Length: 4737, dtype: bool

In [20]:
#Check whether it is start of month or not
df['Date_Time'].dt.is_month_start

0       False
1       False
2       False
3       False
4       False
        ...
4732    False
4733    False
4734    False
4735    False
4736    False
Name: Date_Time, Length: 4737, dtype: bool

In [21]:
#Check whether is is start of quarter or not
df['Date_Time'].dt.is_quarter_start

0       False
1       False
2       False
3       False
4       False
        ...
4732    False
4733    False
4734    False
4735    False
4736    False
Name: Date_Time, Length: 4737, dtype: bool

In [22]:
#Check whether is is end of quarter or not
df['Date_Time'].dt.is_quarter_end

0       False
1       False
2       False
3       False
4       False
        ...
4732    False
4733    False
4734    False
4735    False
4736    False
Name: Date_Time, Length: 4737, dtype: bool

### Pull it all together

In [23]:
new_df = pd.DataFrame({'year' : df['Date_Time'].dt.year,
                      'month' : df['Date_Time'].dt.month,
                      'day' : df['Date_Time'].dt.day,
                      'hour' : df['Date_Time'].dt.hour,
                      'dayofyear' : df['Date_Time'].dt.dayofyear,
                      'week' : df['Date_Time'].dt.week,
                      'dayofweek' : df['Date_Time'].dt.dayofweek,
                      'dayofweekname' : df['Date_Time'].dt.strftime('%A'),
                      'quarter' : df['Date_Time'].dt.quarter})
new_df.head()

   year  month  day  hour  dayofyear  week  dayofweek dayofweekname  quarter
0  2004      3   10    18         70    11          2     Wednesday        1
1  2004      3   10    19         70    11          2     Wednesday        1
2  2004      3   10    20         70    11          2     Wednesday        1
3  2004      3   10    21         70    11          2     Wednesday        1
4  2004      3   10    22         70    11          2     Wednesday        1

In [24]:
final_df = pd.concat([df, new_df], axis=1)
final_df.head(10)

,Date_Time,NO2(GT),year,month,day,hour,dayofyear,week,dayofweek,dayofweekname,quarter
0,2004-03-10 18:00:00,166,2004,3,10,18,70,11,2,Wednesday,1
1,2004-03-10 19:00:00,1174,2004,3,10,19,70,11,2,Wednesday,1
2,2004-03-10 20:00:00,131,2004,3,10,20,70,11,2,Wednesday,1
3,2004-03-10 21:00:00,172,2004,3,10,21,70,11,2,Wednesday,1
4,2004-03-10 22:00:00,131,2004,3,10,22,70,11,2,Wednesday,1
5,2004-03-10 23:00:00,89,2004,3,10,23,70,11,2,Wednesday,1
6,2004-03-11 00:00:00,62,2004,3,11,0,71,11,3,Thursday,1
7,2004-03-11 01:00:00,1453,2004,3,11,1,71,11,3,Thursday,1
8,2004-03-11 02:00:00,45,2004,3,11,2,71,11,3,Thursday,1
9,2004-03-11 03:00:00,-200,2004,3,11,3,71,11,3,Thursday,1

### is_weekday? (Create using the dayofweek numbers)

In [25]:
#Check whether it is weekday or not and store answer in newly created column
final_df['is_weekday'] = 0

for i in range(0, len(final_df)):
    if ((final_df['dayofweek'][i] == 5) | (final_df['dayofweek'][i] == 6)):
        final_df['is_weekday'][i] = 0
    else:
        final_df['is_weekday'][i] = 1

In [26]:
final_df[['dayofweek', 'is_weekday']].head()

   dayofweek  is_weekday
0          2           1
1          2           1
2          2           1
3          2           1
4          2           1